<?php 
    $score = 60;

    //ถ้าคะแนนมากกว่า 50 - 59 ให้แสดง เกรด D
    //ถ้าคะแนนมากกว่า 60 - 69 ให้แสดง เกรด C
    //ถ้าคะแนนมากกว่า 70 - 79 ให้แสดง เกรด B
    //ถ้าคะแนนมากกว่า 80 - 100 ให้แสดง เกรด A
    //ถ้าคะแนนต่ำกว่า 50 ให้แสดง เกรด F

    if($score>=0 && $score<=49){
        echo "เกรด F";
    }elseif($score>=50 && $score<=59){
        echo "เกรด D";
    }elseif($score>=60 && $score<=69){
        echo "เกรด C";
    }elseif($score>=70 && $score<=79){
        echo "เกรด B";
    }elseif($score>=80 && $score<=100){
        echo "เกรด A";
    }else{
        echo "ข้อมูลไม่ถูกต้อง";
    }
?>