<?php
    $a = 5;  //เพิ่มค่า
    $b = 10; //ลดค่า

    //เพิ่มค่า
    echo "ค่าเริ่มต้นของ a = ".$a."<br>";  //5
    echo "เพิ่มค่าแบบ prefix =".(++$a)."<br>"; //6
    echo "ค่าล่าสุดของ a = ".$a."<br>"; //6
    echo "<hr>";

    echo "ค่าเริ่มต้นของ a = ".$a."<br>";  //6
    echo "เพิ่มค่าแบบ postfix =".($a++)."<br>"; //6
    echo "ค่าล่าสุดของ a = ".$a."<br>"; //7
    echo "<hr>";

    //ลดค่า
    echo "ค่าเริ่มต้นของ b = ".$b."<br>";  //10
    echo "ลดค่าแบบ prefix =".(--$b)."<br>"; //9
    echo "ค่าล่าสุดของ b = ".$b."<br>"; //9
    echo "<hr>";

    echo "ค่าเริ่มต้นของ b = ".$b."<br>";  //9
    echo "ลดค่าแบบ postfix =".($b--)."<br>"; //9
    echo "ค่าล่าสุดของ b = ".$b."<br>"; //8
    echo "<hr>";
?>